ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговоровОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПричиныЗакрытияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АннулированиеЛицензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВступилВСилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоРешениюСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходДосрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоИнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъединениеСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПереносСредствНаДругойДоговорФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НазначенаВыплатаПредыдущимСтраховщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/уп_СистемаГарантирования/Ext/Module.bsl
&ИзменениеИКонтроль("СформироватьПоЧастямПлановая_ДоговорыЗаПериод")
Функция ХМСформироватьПоЧастямПлановая_ДоговорыЗаПериод(Объект)
	//собираем все в накопительном периоде
	//как быть с теми у кого какой либо из субсчетов в выплатном - они вообще должны попадать?
	//или у них только тот субсчет, который в накопительном должен попасть?   
	//необходимо еще возврат МСК учесть

	ТабДокументов = Новый ТаблицаЗначений;
	ТабДокументов.Колонки.Добавить("Документ");
	ТабДокументов.Колонки.Добавить("Сумма");

	ЗапросД = Новый Запрос;
	ЗапросД.Текст = 
	"ВЫБРАТЬ
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения
	|ПОМЕСТИТЬ ОбщееСостояние
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_СостоянияДоговораОПССрезПоследних
	|ГДЕ
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние В(&СписокСостояний)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4133
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХМ_ДатыВозвращений.ДоговорОПС КАК ДоговорОПС,
	|	НАЧАЛОПЕРИОДА(ХМ_ДатыВозвращений.ДатаВступленияВСилу, ДЕНЬ) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ДатыВозвращений
	|ИЗ
	|	РегистрСведений.ХМ_ДатыВступленияВСилуВозвращенныхДоговоровОПС КАК ХМ_ДатыВозвращений
	|ГДЕ
	|	ХМ_ДатыВозвращений.ДоговорОПС.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПервых.Состояние,
	|	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ,
	|	НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПервых.Период, ДЕНЬ) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ДатыВступленияВСилу
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПервых(
	|			,
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4133
	|			ДоговорОПС НЕ В (ВЫБРАТЬ ДоговорОПС ИЗ ДатыВозвращений) И	
#КонецВставки
	|			ДоговорОПС.Организация = &Организация
	|				И Состояние = &ИсходноеСостояние) КАК уп_СостоянияДоговораОПССрезПервых
	|ГДЕ
	|	уп_СостоянияДоговораОПССрезПервых.Период МЕЖДУ &Дата1 И &Дата2
	|
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4133
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыВозвращений.ДоговорОПС,
	|	NULL,
	|	NULL,
	|	ДатыВозвращений.ДатаВступленияВДействие
	|ИЗ
	|	ДатыВозвращений КАК ДатыВозвращений
	|ГДЕ
	|	ДатыВозвращений.ДатаВступленияВДействие МЕЖДУ &Дата1 И &Дата2
#КонецВставки
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	ВЫБОР
	|		КОГДА уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти)
	|			ТОГДА 1
	|		КОГДА уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ЕдиновременнаяВыплата)
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ПричиныЗакрытия
	|ИЗ
	|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщееСостояние.ДоговорОПС,
	|	ОбщееСостояние.Состояние,
	|	ОбщееСостояние.ПодразделениеБУ,
	|	ДатыВступленияВСилу.ДатаВступленияВДействие,
	|	ОбщееСостояние.ДоговорОПСДатаЗаключения
	|ПОМЕСТИТЬ СписокДоговоровПоДатеВступленияВДействие
	|ИЗ
	|	ДатыВступленияВСилу КАК ДатыВступленияВСилу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщееСостояние КАК ОбщееСостояние
	|		ПО ДатыВступленияВСилу.ДоговорОПС = ОбщееСостояние.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокДоговоровПоДатеВступленияВДействие.ДоговорОПС,
	|	СписокДоговоровПоДатеВступленияВДействие.Состояние,
	|	ЕСТЬNULL(ПричиныЗакрытия.ПричинаЗакрытия, 0) КАК ПричинаЗакрытия,
	|	СписокДоговоровПоДатеВступленияВДействие.ПодразделениеБУ
	|ИЗ
	|	СписокДоговоровПоДатеВступленияВДействие КАК СписокДоговоровПоДатеВступленияВДействие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПричиныЗакрытия КАК ПричиныЗакрытия
	|		ПО СписокДоговоровПоДатеВступленияВДействие.ДоговорОПС = ПричиныЗакрытия.ДоговорОПС";

	//ЗапросД.УстановитьПараметр("ДатаДок", КонецДня(Объект.ДатаФормированияДокументов));
	ЗапросД.УстановитьПараметр("ДатаДок", КонецДня(Объект.ДатаРасчета));
	ЗапросД.УстановитьПараметр("Организация", Объект.Организация);
	ЗапросД.УстановитьПараметр("Дата1", НачалоДня(Объект.ДатаНачала));
	ЗапросД.УстановитьПараметр("Дата2", КонецДня(Объект.ДатаОкончания));
	ЗапросД.УстановитьПараметр("ИсходноеСостояние", Объект.СостояниеВступленияВДействие);
	//ЗапросД.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НакопительныйПериод);

	СписокСостояний = Новый СписокЗначений;
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ЕдиновременнаяВыплата);
	СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
	ЗапросД.УстановитьПараметр("СписокСостояний", СписокСостояний);//убираем закрытые договоры

	ТабДоговоров = Новый ТаблицаЗначений;
	ТабДоговоров.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	//ТабДоговоров.Колонки.Добавить("ЕстьДопЧасть", Новый ОписаниеТипов("Булево"));
	//ТабДоговоров.Колонки.Добавить("ЕстьОснЧасть", Новый ОписаниеТипов("Булево"));
	ТабДоговоров.Колонки.Добавить("ПодразделениеБУ", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТабДоговоров.Колонки.Добавить("Состояние", Новый ОписаниеТипов("ПеречислениеСсылка.уп_СостоянияДоговоровОПС"));
	ТабДоговоров.Колонки.Добавить("ПричинаЗакрытия", Новый ОписаниеТипов("Число"));

	РезультатД = ЗапросД.Выполнить();
	ВыборкаД = РезультатД.Выбрать();
	Ном = 0;
	КолСтрокВТаблице = 50000;

	Пока ВыборкаД.Следующий() Цикл
		Если Ном = КолСтрокВТаблице Тогда
			//это плановая только по тем, по кому 5 лет прошло
			СравнитьСГарантированнойСуммойЧастями(Объект, ТабДоговоров, ТабДокументов);
			Ном = 0;
			ТабДоговоров.Очистить();
		КонецЕсли;	
		Ном = Ном+1;
		НовСтр = ТабДоговоров.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаД);
	КонецЦикла;	


	//это плановая только по тем, по кому 5 лет прошло
	СравнитьСГарантированнойСуммойЧастями(Объект, ТабДоговоров, ТабДокументов);


	Возврат ТабДокументов;

КонецФункции

&ИзменениеИКонтроль("ПлановаяФиксацияПоЧастям_ДоговорыЗаПериод")
Функция ХМПлановаяФиксацияПоЧастям_ДоговорыЗаПериод(Объект)
	//собираем все в накопительном периоде
	//как быть с теми у кого какой либо из субсчетов в выплатном - они вообще должны попадать?
	//или у них только тот субсчет, который в накопительном должен попасть?

	ТабДокументов = Новый ТаблицаЗначений;
	ТабДокументов.Колонки.Добавить("Документ");
	ТабДокументов.Колонки.Добавить("Сумма");

	ЗапросД = Новый Запрос;
	ЗапросД.Текст = 
	"ВЫБРАТЬ
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения
	|ПОМЕСТИТЬ ОбщееСостояние
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_СостоянияДоговораОПССрезПоследних
	|ГДЕ
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние В(&СписокСостояний)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4133
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХМ_ДатыВозвращений.ДоговорОПС КАК ДоговорОПС,
	|	НАЧАЛОПЕРИОДА(ХМ_ДатыВозвращений.ДатаВступленияВСилу, ДЕНЬ) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ДатыВозвращений
	|ИЗ
	|	РегистрСведений.ХМ_ДатыВступленияВСилуВозвращенныхДоговоровОПС КАК ХМ_ДатыВозвращений
	|ГДЕ
	|	ХМ_ДатыВозвращений.ДоговорОПС.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
#КонецВставки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПервых.Состояние,
	|	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ,
	|	НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПервых.Период, ДЕНЬ) КАК ДатаВступленияВДействие
	|ПОМЕСТИТЬ ДатыВступленияВСилу
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПервых(
	|			,
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4133
	|			ДоговорОПС НЕ В (ВЫБРАТЬ ДоговорОПС ИЗ ДатыВозвращений) И	
#КонецВставки
	|			ДоговорОПС.Организация = &Организация
	|				И Состояние = &ИсходноеСостояние) КАК уп_СостоянияДоговораОПССрезПервых
	|ГДЕ
	|	уп_СостоянияДоговораОПССрезПервых.Период МЕЖДУ &Дата1 И &Дата2
	|
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4133
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыВозвращений.ДоговорОПС,
	|	NULL,
	|	NULL,
	|	ДатыВозвращений.ДатаВступленияВДействие
	|ИЗ
	|	ДатыВозвращений КАК ДатыВозвращений
	|ГДЕ
	|	ДатыВозвращений.ДатаВступленияВДействие МЕЖДУ &Дата1 И &Дата2
#КонецВставки
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	ВЫБОР
	|		КОГДА уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти)
	|			ТОГДА 1
	|		КОГДА уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ЕдиновременнаяВыплата)
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ПричиныЗакрытия
	|ИЗ
	|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщееСостояние.ДоговорОПС,
	|	ОбщееСостояние.Состояние,
	|	ОбщееСостояние.ПодразделениеБУ,
	|	ДатыВступленияВСилу.ДатаВступленияВДействие,
	|	ОбщееСостояние.ДоговорОПСДатаЗаключения
	|ПОМЕСТИТЬ СписокДоговоровПоДатеВступленияВДействие
	|ИЗ
	|	ДатыВступленияВСилу КАК ДатыВступленияВСилу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщееСостояние КАК ОбщееСостояние
	|		ПО ДатыВступленияВСилу.ДоговорОПС = ОбщееСостояние.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокДоговоровПоДатеВступленияВДействие.ДоговорОПС,
	|	СписокДоговоровПоДатеВступленияВДействие.Состояние,
	|	ЕСТЬNULL(ПричиныЗакрытия.ПричинаЗакрытия, 0) КАК ПричинаЗакрытия,
	|	СписокДоговоровПоДатеВступленияВДействие.ПодразделениеБУ
	|ИЗ
	|	СписокДоговоровПоДатеВступленияВДействие КАК СписокДоговоровПоДатеВступленияВДействие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПричиныЗакрытия КАК ПричиныЗакрытия
	|		ПО СписокДоговоровПоДатеВступленияВДействие.ДоговорОПС = ПричиныЗакрытия.ДоговорОПС";

	//ЗапросД.УстановитьПараметр("ДатаДок", КонецДня(Объект.ДатаФормированияДокументов));
	ЗапросД.УстановитьПараметр("ДатаДок", КонецДня(Объект.ДатаРасчета));
	ЗапросД.УстановитьПараметр("Организация", Объект.Организация);
	ЗапросД.УстановитьПараметр("Дата1", НачалоДня(Объект.ДатаНачала));
	ЗапросД.УстановитьПараметр("Дата2", КонецДня(Объект.ДатаОкончания));
	ЗапросД.УстановитьПараметр("ИсходноеСостояние", Объект.СостояниеВступленияВДействие);
	//ЗапросД.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НакопительныйПериод);

	СписокСостояний = Новый СписокЗначений;
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ЕдиновременнаяВыплата);
	СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
	//СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
	ЗапросД.УстановитьПараметр("СписокСостояний", СписокСостояний);//убираем закрытые договоры

	ТабДоговоров = Новый ТаблицаЗначений;
	ТабДоговоров.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	//ТабДоговоров.Колонки.Добавить("ЕстьДопЧасть", Новый ОписаниеТипов("Булево"));
	//ТабДоговоров.Колонки.Добавить("ЕстьОснЧасть", Новый ОписаниеТипов("Булево"));
	ТабДоговоров.Колонки.Добавить("ПодразделениеБУ", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТабДоговоров.Колонки.Добавить("Состояние", Новый ОписаниеТипов("ПеречислениеСсылка.уп_СостоянияДоговоровОПС"));
	ТабДоговоров.Колонки.Добавить("ПричинаЗакрытия", Новый ОписаниеТипов("Число"));

	РезультатД = ЗапросД.Выполнить();
	ВыборкаД = РезультатД.Выбрать();
	Ном = 0;
	КолСтрокВТаблице = 50000;

	Пока ВыборкаД.Следующий() Цикл
		Если Ном = КолСтрокВТаблице Тогда
			//это фиксация при вступлении в систему гарантирования
			ФиксироватьЧастьПлановая(Объект, ТабДоговоров, ТабДокументов);
			Ном = 0;
			ТабДоговоров.Очистить();
		КонецЕсли;	
		Ном = Ном+1;
		НовСтр = ТабДоговоров.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаД);
	КонецЦикла;	
	ФиксироватьЧастьПлановая(Объект, ТабДоговоров, ТабДокументов);

	Возврат ТабДокументов;

КонецФункции
